;;******************************************
;; タイトル：エラトステネスのふるい
;; 著者：山本修身 (osami@ccmfs.meijo-u.ac.jp)
;; 日付：2009年 4月11日 土曜日 15時37分53秒 jst
;;******************************************

(start:
  ;;;;;;;;;;;;;;;
  ;; ---------------------------------
  ;; メモリの初期化を行う
  ;; 10番地以降が配列データ
  ;; ---------------------------------
  ;;;;;;;;;;;;;;;
  (load =10)
  (store 1)      ; r1 ←  10
  loop1:
  (load =1)      ; r[r1] ←  1
  (store *1)
  (load 1)       ; r1 ←  r1 + 1
  (add =1)
  (store 1)
  (sub =1010)    ; r1が1010を超えたらskip1へ
  (jgtz skip1)
  (jump loop1)   ; そうでなければloop1へ
  skip1:  
  (write =8888)  ; スタートの印
  ;; ---------------------------------
  ;; 計算開始
  ;; ---------------------------------
  (load =2)      ; r1 ←  1
  (store 1)
  loop3:
  (load 1)       ; r0 ←  r[r1 + 10]
  (add =10)
  (load *0)   
  (jzero skip2)  ; ゼロだったら skip2へ
  (write 1)      ; r1は素数なので出力する
  (load 1)       ; r2 ←  r1 + r1
  (add 1)
  (store 2)
  loop2:
  (load 2)       ; r[r2 + 10] ←  0
  (add =10)
  (store 3)
  (load =0)
  (store *3)
  (load 2)       ; r2 ←  r2 + r1
  (add 1)
  (store 2)
  (sub =1000)    ; 1000を超えたらskip2へ
  (jgtz skip2)
  (jump loop2)   ; そうでなければloop2へ戻る
  skip2:
  (load 1)       ; r1 ←  r1 + 1
  (add =1)
  (store 1)
  (sub =1000)    ; r1が1000を超えたらskip3へ
  (jzero skip3)
  (jump loop3)   ; そうでなければloop3へ戻る
  skip3:
  (halt))         ; 実行終了
  

